{
  "administrador": [
    {
      "email": "donroot@gmail.com",
      "senha": "donroot"
    }
  ],
  "user": [
    {
      "id": 0,
      "nome": "donerms",
      "email": "derni@gmail.com",
      "senha": "@dfdsf455"
    },
    {
      "nome": "Don carderms",
      "email": "doncarderms@gmail.com",
      "senha": "2468",
      "id": 1
    },
    {
      "nome": "Derni loko",
      "email": "lokoggjk@gmail.com",
      "senha": "234356@wer",
      "id": 2
    },
    {
      "nome": "bugi loko",
      "email": "bugikolo@gmail.com",
      "senha": "2343refr345",
      "id": 3
    },
    {
      "nome": "Derni loko2",
      "email": "dfgfd",
      "senha": "gfgdf",
      "id": 4
    },
    {
      "nome": "Derni loko1",
      "email": "sfdsfg",
      "senha": "dgfgdfg",
      "id": 5
    },
    {
      "nome": "bugi kani",
      "email": "kali23@gmail.com",
      "senha": "kali89",
      "id": 6
    },
    {
      "nome": "teste",
      "email": "testeUser1@teste.com.br",
      "senha": "#testeyuser1",
      "id": 7
    },
    {
      "nome": "teste3",
      "email": "teste3@gmail.com",
      "senha": "teste3",
      "id": 8
    }
  ],
  "autor": [
    {
      "id": 0,
      "nome": "Eduardo Danilo da Mata",
      "email": "eduardo_damata@gmaill.com",
      "senha": "PJ2g1yuaGy"
    },
    {
      "nome": "Luiz Bruno Caldeira",
      "email": "luiz-caldeira77@futureteeth.com.br",
      "senha": "rYOy2aUy08",
      "id": 1
    },
    {
      "nome": "Miguel Kevin Duarte",
      "email": "miguel.kevin.duarte@atrix.com.br",
      "senha": "GKZHkh8D3b",
      "id": 2
    }
  ],
  "categorias": [
    {
      "id": 0,
      "nome": "devops"
    },
    {
      "nome": "news",
      "id": 1
    },
    {
      "nome": "fofoca",
      "id": 2
    },
    {
      "nome": "series e filmes",
      "id": 3
    },
    {
      "nome": "tecnologia",
      "id": 4
    },
    {
      "nome": "Negócios",
      "id": 5
    }
  ],
  "postagens": [
    {
      "autor_id": "2",
      "categoria_id": 0,
      "titulo": "Identificação de Conceitos e Atributos",
      "conteudo": "\nExercício 1: Deseja-se construir um sistema para manter um registro de artistas\nmusicais e seus álbuns. Cada álbum possui várias músicas, as quais poderão ser\nconsultadas pelo sistema. O sistema também deve permitir a busca de artistas por\nnome ou nacionalidade. O sistema também deve ser capaz de exibir um relatório\ndos álbuns de um artista, o qual pode ser ordenado por nome, ano, ou duração total\ndo álbum. Um álbum pode ter a participação de vários artistas, sem distinção. Já a\nmúsica pode possuir um ou mais autores e intérpretes (todos considerados artistas).\nExercício 2: Deseja-se construir um sistema para gerenciar as informações de\ncampeonatos de handebol, que ocorrem todo ano. Deseja-se saber nome, data de\nnascimento, gênero e altura dos jogadores de cada time, bem qual deles é o capitão\nde cada time. Cada partida do campeonato ocorre em um estádio, que possui nome\ne endereço. Cada time possui seu estádio-sede e, assim, cada partida possui um\ntime mandante (anfitrião) e o time visitante. O sistema deve ser capaz de listar as\npartidas já ocorridas e não ocorridas de um campeonato. O sistema deve também\nser capaz de listar a tabela do campeonato, ordenando os times por classificação,\nque é calculada em primeiro lugar por saldo de\nvitórias e em segundo lugar por saldo de gols.\nExercício 3: Deseja-se fazer um sistema de rede social. Nesta rede social, os\nusuários podem seguir e ser seguidos por outros usuários. O perfil do usuário deve\npermitir cadastrar nome, email, data de nascimento, website, gênero, telefone e foto\ndo perfil. Os usuários podem fazer postagens de texto em sua própria \"linha do\ntempo\" (timeline) da rede social, sendo que podem anexar também fotos às\npostagens. Uma foto é referenciada pela URI de seu local de armazenamento. As\nfotos podem ser organizadas em álbuns, sendo que cada álbum possui um título.",
      "id": 6
    },
    {
      "autor_id": "0",
      "categoria_id": "4",
      "titulo": "Tesla reduz preços nos EUA e na Europa em até 20%",
      "conteudo": "A Tesla está cortando preços em toda a Europa e nos EUA. A Reuters relata que os preços do Modelo Y com tração traseira caíram 17% na Alemanha, com cortes de 20% para o Modelo Y de longo alcance nos EUA. A Tesla também cortou os preços de seu Modelo X e Modelo S nos EUA. Os cortes de preços chegam menos de um ano depois que a Tesla fez vários aumentos de preços em 2022.\n\n“No final de um ano turbulento com interrupções na cadeia de suprimentos, conseguimos uma normalização parcial da inflação de custos, o que nos dá confiança para repassar esse alívio aos nossos clientes”, disse um porta-voz da Tesla Alemanha em comunicado à Reuters .\n\nAs mudanças de hoje colocam os preços do Modelo 3 e do Modelo Y abaixo do preço listado antes dos grandes aumentos iniciais de preços da Tesla, quase um ano atrás. O pesquisador de EV Troy Teslike compilou uma lista mostrando as mudanças de preço nos EUA, com o modelo Y de longo alcance agora $ 13.000 mais barato antes do crédito fiscal e $ 20.500 mais barato incluindo o crédito. Isso é um desconto de 31% no total após o crédito fiscal.",
      "id": 7
    },
    {
      "autor_id": "0",
      "categoria_id": "4",
      "titulo": "Nvidia Broadcast agora pode fazer deepfake em seus olhos para fazer você olhar para a câmera",
      "conteudo": "O software de streaming da Nvidia agora tem a opção de fazer parecer que você está fazendo contato visual com a câmera, mesmo que esteja olhando para outro lugar na vida real. Usando AI, o recurso “Eye Contact” adicionado ao Nvidia Broadcast 1.4 substituirá seus olhos por olhos “simulados” que estão alinhados com sua câmera – um efeito que funcionou muito bem quando nós mesmos o testamos, exceto por todas as vezes que não funcionou. t.\n\nEm uma postagem de anúncio , a empresa escreve que o recurso é destinado a “criadores de conteúdo que procuram se gravar enquanto lêem suas anotações ou um roteiro” sem ter que olhar diretamente para a câmera. Apresentá-lo como algo que você usaria durante uma apresentação pública, em vez de algo que você usaria socialmente, evita os dilemas que acompanham esse tipo de tecnologia. É rude usar IA para enganar minha mãe e fazê-la pensar que estou participando de nossa videochamada quando, na verdade, estou olhando para o meu telefone? Ou fazer meu chefe pensar que não estou escrevendo um artigo em meu outro monitor durante uma reunião? (Vou dizer que sim, já que ser pego em qualquer um dos cenários me colocaria em maus lençóis.)\n\nA Nvidia sugere que o Eye Contact tentará fazer com que seus olhos simulados correspondam à cor dos seus olhos reais, e há “até mesmo um recurso de desconexão caso você olhe muito longe”.\n\nAqui está uma demonstração lado a lado com um fluxo não editado, para que você possa comparar como meus olhos estão realmente se movendo e como o software da Nvidia os renderiza:",
      "id": 8
    },
    {
      "autor_id": "0",
      "categoria_id": "4",
      "titulo": "Os funcionários da Microsoft estão tendo folga ilimitada",
      "conteudo": "A Microsoft está dando folga ilimitada a seus funcionários americanos. O anúncio foi feito em um e-mail aos funcionários de Kathleen Hogan, diretora de pessoal da Microsoft, hoje em um memorando visto pelo The Verge . A Microsoft está chamando sua folga ilimitada de “Folga Discricionária” e se aplicará a todos os funcionários assalariados dos EUA.\n\n“Como, quando e onde fazemos nosso trabalho mudou drasticamente”, explica Hogan no memorando interno. “E conforme nos transformamos, modernizar nossa política de férias para um modelo mais flexível foi o próximo passo natural.”\n\nAs mudanças começarão em 16 de janeiro e significam que até mesmo os novos funcionários da Microsoft não precisam mais esperar para acumular férias. A Microsoft oferecerá 10 feriados corporativos, licenças, folgas por doença e problemas de saúde mental e tempo ausente para serviço de júri ou luto juntamente com esta nova política de folga ilimitada. Os funcionários que tiverem um saldo de férias não utilizado receberão um pagamento único em abril.",
      "id": 9
    },
    {
      "autor_id": "2",
      "categoria_id": "4",
      "titulo": "GPT-4, le bond exponentiel après ChatGPT",
      "conteudo": "La vitesse à laquelle l’intelligence artificielle (IA) évolue est déjà folle. L’arrivée attendue vers la fin 2023 de GPT-4, la prochaine génération du système qui donne vie aux interfaces ChatGPT et Dall-E, va encore plus accélérer la tendance.\n\nLes gens qui sont déjà essoufflés par les progrès survenus ces derniers mois en matière de compréhension et de génération automatisées du langage naturel sont invités à reprendre leur souffle, le temps de consulter un dictionnaire et de noter la définition du terme « exponentiel ». Car c’est à peu près ce que nous vivons ces jours-ci : une amélioration qui semble être toujours plus rapide des systèmes informatisés mis à la disposition d’à peu près tout le monde.\n\nOù s’arrêteront ces avancées ? Il semble difficile de le prédire. En revanche, on doit déjà penser aux effets pervers que ces systèmes auront sur le quotidien de nombreuses personnes si on ne les encadre pas très rapidement.\n\nIntelligence générale artificielle\n \nCar il faut sur-le-champ empêcher la balloune de gonfler jusqu’à un certain niveau d’éclatement. Rappelons que, malgré les plus récents progrès, les interfaces d’IA qu’on a vues émerger ces derniers mois ne sont pas parfaites. Elles s’approchent un peu de﻿ cet autre concept cher à la recherche informatique, celui d’une intelligence générale artificielle, ou « AGI » selon son acronyme anglophone, mais elles ne s’y apparentent pas encore.\n\nUn tel système, selon la définition acceptée, aurait la forme d’un logiciel auquel on pourrait poser à peu près tout type de problème et qui saurait comment trouver la bonne solution. Une telle IA pourrait en principe effectuer toutes les tâches intellectuelles que les humains sont capables d’accomplir.\n\nÉvidemment, pour y arriver, une telle IA devra être en mesure de faire la distinction entre ce qui est vrai, et pas seulement vraisemblable, et ce qui est faux, même si c’est probable. Idéalement, ses créations, ses oeuvres, devraient être authentiques, et pas seulement un collage de styles ou d’inspirations manifestement repiquées à d’autres. C’est plus apparent du côté du générateur d’images Dall-E, qui est meilleur dans l’imitation du coup de crayon ou de pinceau d’artistes déjà existants qu’il l’est dans le développement de sa propre signature visuelle.\n\nCela dit, la piste est déjà brouillée : sur certains forums Internet où se retrouvent des artistes visuels, on a commencé à bannir des visiteurs dont le style créatif ressemble trop à celui d’une IA. On pourrait voir la même chose survenir dans les écoles plus tard cet hiver, quand les premiers gros travaux seront corrigés, et que des enseignants s’inquiéteront peut-être de lire des travaux qui semblent soudainement plus fouillés qu’à l’habitude.\n\nAutrement dit, même imparfaite, l’IA actuellement accessible par Internet fait déjà sentir sa présence un peu partout. Comme d’habitude, à peu près personne n’était prêt à voir un site Web en apparence tout à fait banal venir transformer radicalement ses habitudes. Surtout pas les gouvernements.\n\nCela serait bien qu’un cadre pour limiter les abus et les travers de l’IA de demain puisse voir le jour… aujourd’hui. Et pas dans cinq ans. L’Europe pourrait adopter son propre cadre l’été prochain.\n\nCe ne sera pas trop tôt, étant donné que la prochaine mise à niveau des Dall-E et ChatGPT de ce monde est attendue au courant de l’année.\n\nGPT-4\n \nMis en ligne au début de décembre 2022, ChatGPT n’a eu besoin que d’une semaine pour secouer l’Internet en entier. Ce logiciel Web repose sur un modèle d’apprentissage machine appelé GPT-3. C’était, à ce moment, la plus récente version du modèle de « Generative Pre-trained Transformer » produit et constamment développé par les chercheurs d’OpenAI, la société à l’origine de ce système.\n\nDans sa compréhension et sa génération de texte ou de langage, le système GPT-3 traite l’information qu’il reçoit à partir de 175 milliards de critères différents. C’est énorme ! C’est d’ailleurs un problème grave de cette technologie : elle est extrêmement énergivore.\n\nPourtant, ce n’est rien à côté de ce que sera GPT-4, son itération suivante. Selon ce que les dirigeants d’OpenAI ont indiqué dernièrement, GPT-4 pourrait traiter l’information en fonction d’un nombre de critères que les rumeurs situent entre 1 et 100 billions (soit entre 1000 et 100 000 milliards de critères).\n\nCe système sera beaucoup plus puissant ; il lira presque dans nos pensées !\n\nIl pourrait mieux comprendre nos intentions derrière les questions qu’on lui pose, sans qu’elles soient explicites. Il pourrait aussi répondre d’une façon plus naturelle encore, ou en tout cas, capable de mieux imiter une conversation humaine.\n\nOpenAI connaît les limites de sa technologie et pourrait inclure dans GPT-4 des garde-fous qui limiteront la capacité de l’IA à inventer des faussetés. Cela pourrait prendre la forme d’algorithmes d’apprentissage par renforcement prenant davantage en compte la réaction des utilisateurs.\n\nCar, oui, l’interaction avec les humains permet à la machine de s’améliorer. Pris à l’envers, cela signifie que, chaque fois que nous nous amusons avec Dall-E ou ChatGPT, nous contribuons à l’accélération du développement d’une machine qui nous remplacera sans doute un jour dans de nombreuses tâches du quotidien.\n\nEt cela devrait arriver en 2023…\n\n",
      "id": 18
    },
    {
      "autor_id": "2",
      "categoria_id": "1",
      "titulo": "Novo recurso do WhatsApp promete auxiliar quem envia arquivos pelo mensageiro",
      "conteudo": "Nem nos primeiros dias do ano o WhatsApp deixou de trabalhar para trazer novidades para os usuários do aplicativo de mensagens. Desta vez, uma nova atualização promete ajudar quem tem o costume de enviar mídias nas conversas do mensageiro.\n\nComo funciona\nO novo recurso foca em três pontos. São eles:\n\nFuncionalidade: A ferramenta consiste em uma notificação de aviso ao usuário sobre a possiblidade de enviar uma mídia já com a legenda.\nCompatibilidade: No entanto, até o momento, a novidade está disponível apenas para os testadores do WhatsApp beta. Na prática, a atualização é compatível com a versão 2.23.2.2 para Android.\nPrévia: Desta forma, a mensagem do sistema aparece assim que o usuário encaminhar uma imagem, vídeo, GIF ou mesmo documento.\nIsso porque, em uma de suas últimas atualizações do WhatsApp beta, alguns testadores experimentaram tal recurso de legenda nas mídias. Por isso, o aplicativo resolveu adicionar um lembrete para os usuários não se esquecerem desta novidade\n\nAgora a notificação aparece assim que uma imagem, vídeo, GIF ou documento é encaminhado na conversa. Desta forma, além da possibilidade de se adicionar legenda, há também o recurso de remover a legenda inicial antes de enviar ou encaminhar uma mídia.\n\nApesar da novidade ser bem útil para quem gosta de encaminhar arquivos pelo mensageiro, ainda não há previsão de chegada da melhoria para o público em geral do WhatsApp.\n\nFim da compatibilidade\n\nEm fevereiro, alguns modelos de celular iOS e Android deixarão de serem compatíveis com o WhatsApp. No caso do Android, todos os que possuem sistema operacional anterior a 4.1 terão que se despedir do app. Por fim, os iPhones 5s, 6 e 6 Plus também terão as atualizações da ferramenta descontinuadas.\n\n\n",
      "id": 19
    },
    {
      "autor_id": "2",
      "categoria_id": "0",
      "titulo": "O que é o código de status HTTP 304?",
      "conteudo": "HTTP 304, também conhecido como “304 Not Modified”, é um código que comunica ao seu navegador que: “O recurso solicitado não foi modificado desde a última vez que você o acessou”.\n\nA Internet Engineering Task Force (IETF) define o 304 Not Modified como:\n\nO código de status 304 (não modificado) indica que uma solicitação GET ou HEAD condicional foi recebida e teria resultado em uma resposta 200 (OK) se não fosse pelo fato de a condição ter sido avaliada como falsa. Ou seja, não há necessidade de o servidor transferir uma representação do recurso de destino, pois a requisição indica que o cliente, que condicionou a requisição, já possui uma representação válida; o servidor está, portanto, redirecionando o cliente para fazer uso dessa representação armazenada como se fosse a carga útil de uma resposta 200 (OK).\n\nEssencialmente, seu navegador (ou do visitante) está sendo informado pelo servidor de que os recursos armazenados (em cache) no navegador não foram modificados desde a última vez que você visitou essa página.\n\nPor sua vez, seu navegador recupera uma versão salva da página da web do cache . O objetivo disso é melhorar a velocidade e a entrega da página, evitando que seu navegador tenha que baixar repetidamente as mesmas informações.",
      "id": 20
    },
    {
      "autor_id": "2",
      "categoria_id": "4",
      "titulo": "Profissão do futuro: dicas para alavancar a carreira tech – Por Lanna Reis",
      "conteudo": "O mercado de tecnologia no Brasil precisa cobrir um déficit de 100 mil profissionais. Em um segmento cada vez mais amplo, as empresas estão cada vez mais assiduas na busca dos bons techs. No cenário de crise mundial, o setor segue com um dos salários mais altos do país, além de ofertas de vagas todos os dias. De acordo com um levantamento da Associação das Empresas de Tecnologia da Informação e Comunicação e de Tecnologias Digitais (Brasscom), haverá 800 mil novas oportunidades de emprego em tecnologia até 2025. \n\nSegundo a Associação Brasileira de Startups (Abstartups), o Brasil tem hoje 12,7 mil empresas com perfil de base tecnológica. Esse crescimento progressivo pode ser considerado outro impulso para a carreira dos profissionais digitais. A crescente demanda e o incentivo na área de tecnologia fazem a profissão tech ser uma das opções mais chamativas atualmente. O uso dessas tecnologias em diferentes áreas de um negócio, visando melhorar resultados da empresa, vem aumentando cada vez mais, e a utilização de ferramentas como big data, machine learning, inteligência artificial e muitas outras se tornam essenciais em diversos ambientes. \n\nHoje, existem novos formatos de trabalho que envolvem a área de tecnologia, principalmente remotos. São os squads – times multidisciplinares e autogeridos – e o modelo de trabalho baseado em métodos ágeis (rituais e rotinas) – planning, sprints, daily, review e retrospectiva. Mas como o profissional pode se enquadrar nessas novas tendências e alavancar a carreira tech? \n\nPrimeiramente é preciso entender que não é uma tarefa fácil, nem rápida, mas é possível e pode trazer satisfação profissional (além de dinheiro, que todo mundo gosta). Para começar, é preciso saber que as possibilidades são vastas. Existem tarefas para programador ou desenvolvedor de diferentes linguagens, cientista de dados, arquiteto de soluções, entre outras. \n\nUma vez situado dentro das possibilidades e perpectivas do mercado, o segundo passo é se profissionalizar. Uma forma bastante eficiente para começar ou alavancar a carreira é investir em cursos relacionados a área tech, como Desenvolvimento, Dados, Qualidade/Testes, Design e Infraestrutura. Com o constante crescimento, a área vem exigindo profissionais cada vez mais atualizados sobre ferramentas, metodologias de trabalho e muitos outros aspectos. Atualizar-se é um requisito indispensável para quem pretende crescer nesse caminho. \n\nOutra dica é aprender a se vender. Isso mesmo. Um marketing pessoal bacana pode ser o diferencial para atrair o emprego desejado ou trazer novas oportunidades. Siga e se inspire em perfis que admira, busque entrar em contato com pessoas que já alcançaram o que almeja e aposte na criação de uma boa rede de contatos para apresentar currículo e soft skills. Manter o perfil profissional atualizado e completo em plataformas de vagas como LinkedIn, Job Board, GitHub também é fundamental. \n\nPara garantir esse network e ainda viver expressivas trocas de experiências sobre os temas mais atuais do mercado, é essencial participar das comunidades de tecnologia. Esses espaços são ideais para desenvolver skills e potencializar a curva de aprendizagem por meio do engajamento e da contribuição nas diversas atividades propostas pelos grupos. É também uma boa chance de ganhar visibilidade e estar por dentro de várias oportunidades do mercado.  \n\nAs comunidades se formam de maneira orgânica em regiões e cidades diferentes e com linguagens de tecnologia específicas. Elas também criam espaços tanto físicos quanto digitais (Discord, Slack, redes sociais) para se conectarem. Um exemplo é a Comunidade Rede Lobos no Discord que reúne vários talentos digitais abordando temas diversos.  \n\nEstruturar a carreira em TI é um grande desafio para boa parte dos profissionais dessa área, mas com conhecimento e boa vontade é possível quebrar as barreiras da competitividade crescente e se destacar no mercado. Aposte em aprendizado e deixe a porta aberta para se ressignificar todos os dias. A informação e os contatos certos formam profissionais mais independentes e capazes de circular pelas mais diferentes áreas com facilidade. \n\n ",
      "id": 21
    },
    {
      "autor_id": "2",
      "categoria_id": "4",
      "titulo": "Deezer é hackeada e 229 milhões de usuários têm dados vazados",
      "conteudo": "A Deezer, plataforma de streaming de músicas, sofreu nesta semana um ataque hacker que roubou dados de 229 milhões de usuários.\n\nA França, país de origem da empresa, foi o local com mais usuários afetados, com 46,2 milhões de pessoas expostas. O Brasil vem no segundo lugar com 37,1 milhões de usuários prejudicados. Alemanha, Colômbia, Estados Unidos, Grã-Bretanha, Guatemala, México e Turquia também tiveram pessoas com dados vazados.\n\nDe acordo com o site Restore Privacy, os invasores publicaram os dados para a venda em fórum de hackers.\n\nApós a invasão, a Deezer recomenda que os usuários alterem suas senhas de acesso.\n ",
      "id": 22
    },
    {
      "autor_id": "2",
      "categoria_id": "4",
      "titulo": "Segurança e gerenciamento de dados: por que os vazamentos ocorrem? – Por Kendji Wolf",
      "conteudo": "Em meados de setembro, o Banco Central confirmou o quarto vazamento de informações relacionadas à chave PIX, desde o lançamento do meio de pagamentos em fevereiro de 2020. Na época, entre 1º de julho e 14 de setembro, cerca de 137 mil dados de natureza cadastral, sob a guarda e a responsabilidade da ‘Abastece Aí’, foram expostos em virtude de ‘falhas pontuais em sistemas da instituição de pagamento’ – de acordo com o BC. Mais recentemente, a ‘Porto Saúde’ divulgou uma nota na qual se dizia ciente sobre a exposição indevida de dados de algumas das empresas parceiras. Na última quinta-feira de novembro (24), de acordo com a investigação do Cybernews, quase 500 milhões de números de celular de usuários do WhatsApp estavam à venda na deep web. Ao todo, 84 países foram afetados pelo vazamento, sendo o Brasil o 20º da lista, com 8 milhões de números vazados. Por fim, listo – a título informativo – o vazamento de dados que expôs 5,4 milhões de contas do Twitter no início do ano e que, agora, foram novamente expostos em um fórum de hackers, de acordo com o BleepingComputer.\n\nPercebe-se a ocorrência em várias fontes e o Brasil está na 12ª posição do ranking de países mais atingidos. No ano de 2018 foram registrados três grandes incidentes; em 2019, o número chegou a 16 – um aumento de 493%, segundo pesquisa do MIT (Massachusetts Institute of Technology). Já em janeiro de 2021, 223 milhões de dados pessoais foram vazados e, no mês seguinte, 102 milhões de contas de celular caíram na rede. Pelos dados da holandesa Surfshark, empresa de segurança cibernética, estima-se que 455 brasileiros tenham seus dados expostos na internet a cada minuto. O que corrobora para os cerca de 3,2 milhões de pessoas que, apenas no segundo trimestre de 2022, tiveram informações como RG, CPF, CNH, registros bancários, números de celular e outros documentos vazados no país. Diante das comunicações que garantem a segurança da operação, você sabe porque esses eventos acontecem?\n\nPara explicar este contexto, faço uma analogia com uma empresa responsável por transportar valores em carro forte. Considere um banco com cofres, sistema de segurança e equipe devidamente treinada e fortemente armada em carros-fortes blindados. Vê como há todo um aparato para garantir que o transporte seja feito da maneira mais segura possível? Assim também ocorre com a montagem da governança e a segurança do processo de tráfego de dados. As empresas montam seus sistemas com firewall, criptografia e uma malha de cibersegurança que garante que o perímetro esteja seguro para manuseio, uso e transporte de dados, sempre respeitando a LGPD (Lei Geral de Proteção de Dados, promulgada para proteger os direitos fundamentais de liberdade e de privacidade e a livre formação da personalidade de cada indivíduo). Entretanto, assim como ocorre com as empresas de carro-forte, o risco não está apenas no transporte, mas nos inúmeros elementos que precisam ser previstos e monitorados ao longo do trajeto com o intuito de que todas as pessoas, rotinas e processos estejam alinhados e seguros, sem falhas nas barreiras de proteção.\n\nNo entorno da segurança de dados ocorre o mesmo. O risco não está somente no transporte dos dados entre as empresas. Cada pessoa, sistema, banco de dados e os demais elementos de todas as empresas envolvidas na operação precisam estar sob uma governança de segurança de dados que garanta que nenhuma tentativa de invasão seja bem-sucedida, que os acessos às informações e aos bancos de dados estejam somente com as pessoas responsáveis e que os procedimentos sejam seguidos rigorosamente por todos os funcionários (que devem estar bem e regularmente treinados) para que este tipo de ocorrência seja infrutífera. Em caso de alguma inconformidade, o sistema torna-se suscetível e tal vulnerabilidade é maior à medida que a preocupação e governança de segurança de dados é menor. Falhas humanas, na política de acesso a um sistema ou base de dados, assim como falhas no armazenamento da informação ou na segurança de algum equipamento da rede interna da empresa (como notebook, impressoras wi-fi, drives de DVD, pen-drives etc.) são alguns exemplos que culminam no vazamento de informações.\n\nTendo em vista que essas são as principais causas, existem algumas maneiras de prever e, consequentemente, mitigar as chances dessas falhas ocorrerem. O primeiro passo é contar com uma governança de segurança de dados bem estruturada, ativa e proativa para a criação de uma malha de cibersegurança. A segunda dica é potencializar treinamentos e simulações de situações que poderiam colocar a empresa em risco. No que tange a falha de acesso, a governança atua na definição de permissões para cada usuário e o nível de confidencialidade da informação que ele pode acessar. Já para mitigar a falha no armazenamento da informação, a governança define quais informações podem ser extraídas do perímetro seguro e quais podem ser manuseadas em áreas individuais. Por fim, as falhas de segurança dos equipamentos internos podem ser minimizadas com uso de firewall e antivírus sempre habilitados e atualizados, incluindo realização recorrente de testes preventivos que simulem possíveis ataques externos.\n\nResumindo, é a governança quem cria uma malha de cibersegurança para,  essencialmente, garantir que o perímetro de segurança seja definido e assertivo em torno da identidade de uma pessoa ou elemento. Quando tal governança não está bem estruturada, abre-se precedentes para notícias como as supracitadas.\n\n",
      "id": 23
    },
    {
      "autor_id": "2",
      "categoria_id": 1,
      "titulo": "Instagram supera WhatsApp como app mais acessado no Brasil",
      "conteudo": "A mais recente edição da pesquisa da Panorama Mobile Time/Opinion Box relatou que o Instagram conseguiu superar o WhatsApp como aplicativo mais popular no Brasil. Isso quer dizer que a média de tempo na qual o brasileiro passa na plataforma de fotos é maior do que na rede de mensagens. Ambas da Meta.\n\nConforme as informações da pesquisa, 35% dos usuários de smartphones no país usam mais o Instagram. Um ano atrás, ele estava em segundo lugar citado por 27% dos entrevistados. Para efeito de comparação, o WhatsApp está atualmente com 30%.\n\nO sucesso do Instagram se concentra principalmente no público feminino e jovem. Entre as mulheres, 41% apontam o Instagram como o app no qual passam mais tempo ao longo do dia, contra 27% dos homens. No grupo de 16 a 29 anos, o Instagram está na liderança no ranking de apps em que passam mais tempo, de acordo com 45% dos entrevistados nessa faixa etária. O percentual cai para 35% entre aqueles com 30 a 49 anos, e diminui para 21% na faixa a partir de 50 anos.\n\nO WhatsApp, por sua vez, continua sendo o app mais presente na tela inicial do smartphone nacional (54%), assim como segue na liderança do ranking do app mais aberto ao longo do dia, mencionado por 54% dos brasileiros. Em termos de tempo gasto no app, ocupa agora a vice-liderança, caindo de 33% para 30% em um ano. Porém, se fosse considerado apenas o público masculino ele é o campeão nesse quesito (33%), assim como entre as pessoas com 50 anos ou mais (34%).\n\nA pesquisa entrevistou, entre os dias 9 e 21 de novembro de 2022, 2.039 brasileiros com 16 anos ou mais que possuem smartphone. A margem de erro é de 2,2 pontos percentuais e o grau de confiança é de 95%.",
      "id": 24
    },
    {
      "autor_id": "1",
      "categoria_id": 4,
      "titulo": "O Hardware torna-se cada vez mais personalizado",
      "conteudo": "O silício e o hardware especializados têm vindo a ganhar força na indústria da tecnologia de consumo. Tudo, desde os nossos computadores portáteis, aos telemóveis e dispositivos de desgaste estão a sofrer mudanças significativas com a fabricação e adoção do silício personalizado. Embora esta adoção tenha sido rápida para os produtos direcionados ao consumidor, o mesmo não tem acontecido para as aplicações e sistemas empresariais, onde o software e o hardware têm tradicionalmente ciclos de atualização mais longos. Contudo, tudo irá mudar rapidamente nos próximos anos à medida que a acessibilidade e a adoção do silício personalizado ganha espaço.\n\nNa AWS, há uma média de 100 milhões de casos de EC2 (elastic compute) disparados todos os dias. Isto deve-se em grande parte ao facto de termos trabalhado com os clientes ao longo dos anos para compreender o tipo de fluxos que estão a executar, e depois, determinar o que devemos desenvolver a seguir. Tal como os dispositivos de consumo, isto tem levado a AWS a investir fortemente na conceção de chips nos últimos anos. Sabemos que os fluxos que as empresas estão a executar na cloud podem ser mais eficientes e mais rentáveis, se utilizarmos silício personalizado, com materiais que são construídos propositadamente para casos de uso específico.\n\nPor exemplo, os fluxos de aprendizagem mecânica. Os engenheiros de software confiam, tradicionalmente, em GPU (graphics processing units) dispendiosos e ávidos de energia para fazer tudo, desde a construção de modelos até à inferência. No entanto, esta abordagem de tamanho único não é eficiente – a maioria das GPU não são otimizadas para estas tarefas. Nos próximos anos, mais engenheiros vão perceber as vantagens de transferir os fluxos de trabalho para processadores especificamente concebidos para um determinado objetivo, como a formação de modelos (AWS Trainium) e a inferência (AWS Inferentia). À medida que isto acontece, uma nova onda de inovação irá proliferar. Ao realizar uma poupança de 50% no custo para a formação, com uma instância baseada em Trainium, ou 50% melhor desempenho por watt numa instância baseada em Inferentia2, tanto os engenheiros como as empresas vão assistir a uma migração maciça de fluxos de trabalho. O mesmo vai acontecer com as aplicações generalizadas, onde ainda há benefícios na migração para silício personalizado, tais como as instâncias baseadas em Graviton3 que utilizam até 60% menos energia para o mesmo desempenho do que as instâncias EC2 comparáveis.\n\nA poupança de custos e os benefícios de desempenho vão conduzir a mais investigações, mais inovação e eventualmente, mais silício personalizado para outros fluxos específicos, tornando-se num círculo virtuoso. Alan Kay, um cientista de computadores norte-americano, disse que “as pessoas que levam o software a sério devem fazer o seu próprio hardware“. E no próximo ano, as pessoas que levam o software a sério podem começar a tirar partido de tudo o que o silício personalizado tem para oferecer.\n\nMas o mundo do hardware está longe de ser a única área impactada por estas transformações que representam incríveis avanços tecnológicos. A energia inteligente, as redes de logística ou o desporto – tudo vai passar por esta avalanche de inovação.",
      "id": 26
    },
    {
      "autor_id": "1",
      "categoria_id": 4,
      "titulo": "GPT-4, o salto exponencial depois do ChatGPT",
      "conteudo": "A velocidade com que a inteligência artificial (IA) está evoluindo já é insana. A chegada prevista para o final de 2023 do GPT-4, a próxima geração do sistema que dá vida às interfaces ChatGPT e Dall-E, acelerará ainda mais a tendência. As pessoas que já estão sem fôlego com os avanços na compreensão e geração automatizada de linguagem natural nos últimos meses são encorajadas a recuperar o fôlego, dar uma olhada em um dicionário e anotar a definição de “exponencial”. Porque é mais ou menos isso que estamos vivenciando hoje em dia: uma evolução que parece cada vez mais rápida nos sistemas informatizados disponíveis para quase todo mundo. Onde esses avanços vão parar? Parece difícil prever. Por outro lado, devemos desde já pensar nos efeitos perversos que estes sistemas terão no quotidiano de muitas pessoas se não forem fiscalizados muito rapidamente. Inteligência artificial geral Porque devemos evitar imediatamente que o balão infle até um certo nível de estouro. Lembre-se de que, apesar dos progressos mais recentes, as interfaces de IA que vimos surgir nos últimos meses não são perfeitas. Eles se aproximam um pouco mais desse outro conceito caro à pesquisa computacional, o de uma inteligência artificial geral, ou “AGI” na sigla em inglês, mas ainda não estão relacionados a ele. Tal sistema, pela definição aceita, assumiria a forma de um software que poderia ser questionado sobre qualquer tipo de problema e saberia como encontrar a solução correta. Tal IA poderia, em princípio, realizar todas as tarefas intelectuais que os humanos são capazes de realizar. Obviamente, para conseguir isso, tal IA terá que ser capaz de distinguir entre o que é verdadeiro, e não apenas provável, e o que é falso, mesmo que seja provável. Idealmente, suas criações, suas obras devem ser autênticas, e não apenas uma colagem de estilos ou inspirações obviamente tiradas de outras pessoas. Isso é mais aparente no lado do gerador de imagens Dall-E, que é melhor em imitar o lápis ou a pincelada de artistas já existentes do que em desenvolver sua própria assinatura visual. Dito isso, a trilha já está borrada: em certos fóruns da Internet onde artistas visuais se encontram, começamos a banir visitantes cujo estilo criativo se parece muito com o de uma IA. Podemos ver a mesma coisa acontecendo nas escolas no final deste inverno, quando os primeiros grandes trabalhos são corrigidos, e os professores podem ficar preocupados com a leitura de trabalhos que de repente parecem mais pesquisados ​​​​do que o normal. Ou seja, mesmo imperfeita, a IA atualmente acessível via Internet já marca presença em todos os lugares. Como de costume, quase ninguém estava pronto para um site aparentemente mundano transformar radicalmente seus hábitos. Especialmente não governos. Seria bom se uma estrutura para limitar os abusos e falhas da IA ​​de amanhã pudesse ver a luz do dia... hoje. E não em cinco anos. A Europa poderia adotar sua própria estrutura no próximo verão. Não será muito cedo, considerando que a próxima atualização Dall-E e ChatGPT deste mundo é esperada ainda este ano. GPT-4 Lançado no início de dezembro de 2022, o ChatGPT precisou de apenas uma semana para agitar toda a internet. Este software baseado na web é baseado em um modelo de aprendizado de máquina chamado GPT-3. Era, na época, a versão mais recente do modelo “Transformador Pré-treinado Generativo” produzido e constantemente desenvolvido por pesquisadores da OpenAI, empresa por trás desse sistema. Em sua compreensão e geração de texto ou linguagem, o sistema GPT-3 processa as informações que recebe de 175 bilhões de critérios diferentes. É enorme! Este também é um problema sério com esta tecnologia: é extremamente intensiva em energia. Ainda assim, isso não é nada comparado ao que será o GPT-4, sua próxima iteração. De acordo com o que os executivos da OpenAI disseram recentemente, o GPT-4 poderia processar informações de acordo com uma série de critérios que dizem estar entre 1 e 100 trilhões (ou seja, entre 1000 e 100 trilhões de critérios). Este sistema será muito mais poderoso; ele quase vai ler nossos pensamentos! Ele poderia entender melhor nossas intenções por trás das perguntas que fazemos a ele, sem que elas sejam explícitas. Ele também poderia responder de uma forma ainda mais natural, ou pelo menos mais capaz de imitar a conversa humana. A OpenAI conhece os limites de sua tecnologia e pode incluir salvaguardas no GPT-4 que limitarão a capacidade da IA ​​de inventar falsidades. Isso pode assumir a forma de algoritmos de aprendizado por reforço que levam mais em conta o feedback do usuário. Porque, sim, a interação com os humanos permite",
      "id": 27
    },
    {
      "autor_id": "1",
      "categoria_id": 4,
      "titulo": "A LGPD aplicada na área da saúde  Epa! Vimos que você copiou o texto. Sem problemas, desde ",
      "conteudo": "Os estabelecimentos da área da saúde manuseiam grande quantidade de dados pessoais, em especial, dados sensíveis referentes à saúde. Desta forma, importante conhecer e seguir as regras relacionadas ao tratamento de dados pessoais estabelecidas pela Lei Geral de Proteção de Dados.\n\nlink: https://www.migalhas.com.br/depeso/380250/a-lgpd-aplicada-na-area-da-saude",
      "id": 28
    }
  ],
  "comentarios": [
    {
      "user_id": "1",
      "postagem_id": "1",
      "conteudo": "conteudo legal.  😁",
      "id": 1
    },
    {
      "user_id": "0",
      "postagem_id": "1",
      "conteudo": "gostei do conteudo.  👍",
      "id": 2
    },
    {
      "user_id": "1",
      "postagem_id": "2",
      "conteudo": "legal",
      "id": 4
    },
    {
      "user_id": "1",
      "postagem_id": "4",
      "conteudo": "conteudo legal!!!",
      "id": 5
    },
    {
      "user_id": "1",
      "postagem_id": "3",
      "conteudo": "ouauuu muito bom",
      "id": 6
    },
    {
      "user_id": "1",
      "postagem_id": "6",
      "conteudo": "boas conceitos",
      "id": 7
    },
    {
      "user_id": "1",
      "postagem_id": "5",
      "conteudo": " que conteudo sem teto antigão ☹️",
      "id": 8
    },
    {
      "user_id": "1",
      "postagem_id": "7",
      "conteudo": "boa elon musk",
      "id": 9
    },
    {
      "user_id": "1",
      "postagem_id": "8",
      "conteudo": "o placa de video dos meus sonhos  😊",
      "id": 10
    },
    {
      "user_id": "1",
      "postagem_id": "9",
      "conteudo": " queria trabalhar lá",
      "id": 11
    },
    {
      "user_id": "1",
      "postagem_id": "10",
      "conteudo": "valeu pela expilcação ",
      "id": 12
    },
    {
      "user_id": "6",
      "postagem_id": "1",
      "conteudo": "a Alice é corajosa em  😃.",
      "id": 13
    },
    {
      "user_id": "1",
      "postagem_id": "20",
      "conteudo": "ok",
      "id": 14
    },
    {
      "user_id": "1",
      "postagem_id": "20",
      "conteudo": "valeu pelo dica",
      "id": 15
    },
    {
      "user_id": "7",
      "postagem_id": "6",
      "conteudo": "teste de comentario feito",
      "id": 16
    },
    {
      "user_id": "7",
      "postagem_id": "7",
      "conteudo": "teste comentario 2 feito",
      "id": 17
    },
    {
      "user_id": "7",
      "postagem_id": "8",
      "conteudo": "teste comentario 3 feita com sucesso",
      "id": 18
    },
    {
      "user_id": "1",
      "postagem_id": "6",
      "conteudo": "zxv,xcvbnxcb",
      "id": 19
    },
    {
      "user_id": "8",
      "postagem_id": "6",
      "conteudo": "dfhbkjhbkcvhkbjc",
      "id": 20
    }
  ]
}